{
    "projects": [
        {
            "name": "Industriële-loopband",
            "Info": [
                {
                    "Titel": "Ontwikkeling 'Industriële Loopband'",
                    "Stad": "Aarschot",
                    "Datum": "29-03-2023",
                    "Image": "industriële-loopband.png"
                }
            ],
            "Details": [
                {
                    "Tussentitel": "Automatisatie in de Productielijn",
                    "Uitleg": "Dit project omvatte de ontwikkeling van een industriële loopband met luchtdruk- en PLC-technologie. Kleurensensoren bepaalden de richting van blokjes op de band. Na het verplaatsen naar de juiste locatie, werd het blokje met een luchtdrukstamper in het juiste bakje geplaatst. Het proces werd volledig geautomatiseerd."
                }
            ]
        },

        {
            "name": "Webdesign (Front- and backend)",
            "Info": [
                {
                    "Titel": "Full-Stack Webapplicatie",
                    "Stad": "Geel",
                    "Datum": "15 april 2024",
                    "Image": "fullstack_webapp.png"
                }
            ],
            "Details": [
                {
                    "Tussentitel": "Frontend & Backend in Harmoni",
                    "Uitleg": "Een volledige webapplicatie gebouwd met HTML, CSS en JS + Python and mySQL. De webapp stelt het bedrijf in het kort voor, toont seizoensproducten, updates op de werkvloer en geeft de mogelijkheid om jezelf in te schrijven om zelf verse groenten te gaan plukken en/of bestellingen uit te voeren."
                }
            ]
        },

        {
            "name": "Iot-project",
            "Info": [
                {
                    "Titel": "IoT (Donker/LICHT)",
                    "Stad": "Geel",
                    "Datum": "15 april 2024",
                    "Image": "iot_monitoring.jpg"
                }
            ],
            "Details": [
                {
                    "Tussentitel": "IOT slim rolluiken systeem",
                    "Uitleg": "Dit project had als doel een slim IoT-systeem te bouwen dat automatisch de lichtsterkte en temperatuur regelt op basis van vooraf ingestelde waarden. Hiervoor werden een BH1750-lichtsensor en een BMP280-temperatuursensor via I2C verbonden met een microcontroller. De gemeten waarden werden weergegeven op een online dashboard zoals ThingSpeak, en gebruikers konden via GPIO-ingangen doelwaarden instellen voor licht en temperatuur. Het systeem stuurde vervolgens automatisch actuatoren aan (bijv. een PWM-gestuurde LED of een verwarmingselement) om deze doelen te bereiken. Cloudcommunicatie verliep via MQTT en er werd een gesloten regelkring gerealiseerd voor volledig autonome omgevingsregeling."
                }
            ]
        },

        {
            "name": "zwembad-automatisatie",
            "Info": [
              {
                "Titel": "Zwembad Automatisatie Systeem",
                "Stad": "Geel",
                "Datum": "20-12-2024",
                "Image": "zwembad_auto.jpg"
              }
            ],
            "Details": [
              {
                "Tussentitel": "Projectbeschrijving",
                "Uitleg": "Dit project had als doel het automatiseren van zwembadbeheer met behulp van sensoren en een dashboard."
              },
              {
                "Subject": "SKILL2 Semester 1 - Groepsproject",
                "learnings": "Sensorintegratie, datavisualisatie en probleemoplossend werken",
                "realisaties": "Computer die PH-metingen uitvoert en adhv de waarden, een bepaalde hoeveelheid chemicaliën toevoegt"
              },
              {
                "Who": "Sander Broos + 5 studenten",
                "What": "Automatisatie van zwembadwaterbeheer",
                "Where": "Thuisopstelling",
                "Why": "Tijdswinst en kwaliteitsgarantie door digitalisering"
              }
            ]
        },
       
        {
            "name": "localhoster",
            "Info": [
                {
                    "Titel": "Localhoster",
                    "Stad": "Geel",
                    "Datum": "30-04-2025",
                    "Image": "localhoster_ui.png"
                }
            ],
            "Details": [
                {
                    "Tussentitel": "Webhosting platform op eigen Servers",
                    "Uitleg": "Dit project draait om het opzetten van een lokaal webhostingplatform met Kubernetes als fundament. Het platform is ontworpen om meerdere gebruikers applicaties te hosten in een schaalbare en veilige omgeving. Automatisering via Ansible en gebruik van verschillende beveiligingsmaatregelen zoals kwetsbaarheidsscans en encryptie zorgen voor een veilig en betrouwbaar platform."
                },
                {
                    "subject": "Webhosting - SKILL2 (Semester2)",
                    "realisaties": "Zo'n veilig mogelijk, geautomatiseerd en geschaald webhosting platform opzetten, waar klanten hun eigen websites op kunnen hosten",
                    "learnings": "Teamwork, ansible, terraform, metallb, cacti, loki, prometheus, grafana"
                },
                {
                    "Who": "Sander Broos + 5 studenten",
                    "What": "Lokaal webhostingplatform",
                    "Where": "Thomas More, Geel",
                    "Why": "Schaalbare en veilige webhosting opzetten"
                }
            ]
        },

        {
            "name": "docker-kubernetes",
            "Info": [
                {
                    "Titel": "Container Orchestration met Docker & Kubernetes",
                    "Stad": "Geel",
                    "Datum": "11-12-2024",
                    "Image": "docker_kube_cluster.png"
                }
            ],
            "Details": [
                {
                    "Tussentitel": "Schaalbare Microservices",
                    "Uitleg": "Dit project was gericht op het opzetten van een webstack met een frontend, backend en database, allemaal gedraaid op een Kubernetes-cluster. De microservices zijn geïsoleerd in Docker-containers. Het doel was om een schaalbare en flexibele omgeving te creëren die eenvoudig kan worden aangepast en uitgebreid."
                }
            ]
        }
    ]
}

